<a href="https://colab.research.google.com/github/sergeymasl/my_education/blob/main/%22exam_ipynb_analytic%22.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Экзамен по курсу "Аналитика данных на Python"

Этот тест проверит Ваши навыки работы с таблицами данных с помощью библиотек pandas и numpy. Задания делятся на простые (⭐️), средние (⭐️⭐️) и сложные (⭐️⭐️⭐️). Решение простых заданий, как правило, требует одной-двух операций с таблицами, тогда как для более сложных может потребоваться несколько последовательных преобразований данных.

##  Предыстория

Сегодня Ваш первый день работы в крупном интернет-магазине, который продаёт товары с доставкой по всему миру. Ваша первая задача – проанализировать базу данных покупок, совершённых в магазине за последние несколько лет. База содержит информацию об отдельных транзакциях, про каждую из которых известны номер инвойса (InvoiceNo), дата инвойса(InvoiceDate), код товара (StockCode), описание товара(Description), количество товара в транзакции (Quantity), стоимость единицы товара (UnitPrice), код покупателя (CustomerID), страна покупателя (Country).

База выгружена для Вас в формате CSV: файл [```online-retail.csv```](https://drive.google.com/file/d/1O1oJtpEu-u6s6xTu7seQfnNcQjYCt0GF/view?usp=sharing)

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## ⭐️ Вопрос 1

Загрузите данные из файла online-retail.csv в переменную типа pandas DataFrame

Подсказка: Используйте функцию из библиотеки pandas

Какой символ-разделитель используется в этом файле?

* Запятая ","
* Двоеточие ":"
* Точка с запятой ";"
* Символ табуляции "tab"

#### Решение

In [ ]:
df = pd.read_csv('online-retail.csv', sep = ';')
df.head(3)

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom

[3 rows x 8 columns]

## ⭐️ Вопрос 2

Сколько строк в полученной таблице (не считая заголовков столбцов)?

#### Решение

In [ ]:
df.shape[0]

541911

## ⭐️ Вопрос 3

Сколько столбцов в полученной таблице (не считая индекса)?

#### Решение

In [ ]:
df.shape[1]

8

## ⭐️ Вопрос 4

Как называется столбец с самым коротким названием?

#### Решение

In [ ]:
for column in df.columns:
  if len(column) == min(list(map(len, df.columns))):
    print(column)

Country

## ⭐️ Вопрос 5

В скольких столбцах встречаются пропущенные значения? (ответ - целое число)

#### Решение

In [ ]:
for colum in df.columns: 
  print(colum, df[colum].isnull().sum())

InvoiceNo 0
StockCode 0
Description 1455
Quantity 0
InvoiceDate 0
UnitPrice 0
CustomerID 135080
Country 0

## ⭐️ Вопрос 6

Сколько пропущенных значений в столбце CustomerID? (ответ - целое число)

#### Решение

In [ ]:
df['CustomerID'].isnull().sum()

135080

## ⭐️⭐️ Вопрос 7

Посмотрим, данные за какой исторический период у нас есть. 

Данные за какой самый ранний и за какой самый поздний годы содержатся в датасете? В ответе укажите два целых числа через запятую.

#### Решение

In [ ]:
import datetime
df.head(5)

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

In [ ]:
d = datetime.datetime.strptime('2010-12-01 08:26:00', '%Y-%m-%d %H:%M:%S')
print(d.year)

2010

In [ ]:
df['year'] = df['InvoiceDate'].apply(lambda x: datetime.datetime.strptime(x, '%Y-%m-%d %H:%M:%S').year)
df.head(3)

  InvoiceNo StockCode  ...         Country  year
0    536365    85123A  ...  United Kingdom  2010
1    536365     71053  ...  United Kingdom  2010
2    536365    84406B  ...  United Kingdom  2010

[3 rows x 9 columns]

In [ ]:
df['year'].describe()

count    541911.000000
mean       2010.921609
std           0.268786
min        2010.000000
25%        2011.000000
50%        2011.000000
75%        2011.000000
max        2011.000000
Name: year, dtype: float64

## ⭐️ Вопрос 8

Каковы минимальная и максимальная цена товаров (UnitPrice)? Перечислите через запятую. Цена в этом задании может принимать отрицательные значения.

#### Решение

In [ ]:
print(df['unitprice'].min())
print(df['unitprice'].max())

-11062.06
38970.0

## ⭐️ Вопрос 9

В таблице оказались товары с отрицательными ценами! Это явно какая-то ошибка. Какое описание (Description) у таких транзакций? Перечислите все варианты через запятую, отсортировав строки по алфавиту.

#### Решение

In [ ]:
df[df['UnitPrice'] < 0]['Description'].sort_values()

299983    Adjust bad debt
299984    Adjust bad debt
Name: Description, dtype: object

## ⭐️ Вопрос 10

Поищем ещё возможные проблемы с данными. Как насчёт товаров с нулевыми ценами? 

Сколько в таблице транзакций с нулевой ценой? А с пропусками на месте цены? 

Перечислите два целых числа через запятую.

#### Решение

In [ ]:
print(df[df['UnitPrice'] == 0]['UnitPrice'].count())

2515

In [ ]:
print(df['UnitPrice'].isnull().sum())

0

## ⭐️⭐️ Вопрос 11

Для дальнейшего анализа поведения покупателей нам понадобится набор данных, в которых у каждой транзакции корректно указана цена, количество единиц товара (Quantity) и id покупателя (CustomerID). Удалите из таблицы все строки, в которых цена не превосходит 0 или пропущена, или количество единиц товара не превосходит 0 или пропущено, или в которых пропущен id покупателя. 

Сколько строк осталось?

In [ ]:
df.columns = [x.lower() for x in df.columns]

#### Решение

In [ ]:
df_cl = df[(df['unitprice'] > 0) &
           (df['unitprice'].isnull() == 0) &
           (df['quantity'] > 0) &
           (df['quantity'].isnull() == 0) &
           (df['customerid'].isnull() == 0)]
df_cl.shape[0]

397886

## Внимание! 

### Везде далее мы работаем с очищенной таблицей, полученной в Вопросе 11.

## ⭐️⭐️ Вопрос 12

В таблице для каждой транзакции указаны цена за единицу товара (UnitPrice) и количество единиц товара (Quantity). Вычислите для каждой транзакции её **полную стоимость** и сохраните в новом столбце Price, который добавьте в таблицу. 

Каковы минимальная и максимальная полная стоимость транзакций? Перечислите через запятую, округлив до целых чисел.

#### Решение

In [ ]:
df_cl['price'] = df_cl['unitprice'] * df_cl['quantity']

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
print(round(df_cl['price'].min(), 0))
print(round(df_cl['price'].max(), 0))

0.0
168470.0

## ⭐️⭐️ Вопрос 13

В нашей базе данных каждая покупка представлена одной или несколькими транзакциями. Покупка однозначно определяется своим номером инвойса (InvoiceNo). Транзакции, относящиеся к одной покупке, имеют один и тот же InvoiceNo. 

Стоимость всей покупки равна сумме полных стоимостей транзакций, входящих в неё. Найдите стоимости трёх самых дорогих покупок. Перечислите через запятую в порядке убывания, округлив до целых чисел.

#### Решение

In [ ]:
df_cl.head(1)

  invoiceno stockcode  ...         country  price
0    536365    85123A  ...  United Kingdom   15.3

[1 rows x 9 columns]

In [ ]:
top_list = df_cl.groupby('invoiceno').agg('sum').reset_index()[['invoiceno','price']].nlargest(columns ='price', n = 3)
for i in top_list['price']:
  print(round(i,0))

168470.0
77184.0
38970.0

## ⭐️⭐️ Вопрос 14

Какой товар составил наибольшую выручку? В ответе укажите описание товара (дословно строку из соответствующего поля в столбце Description).

#### Решение

In [ ]:
top_stock = df_cl.groupby('description').agg('sum').reset_index()[['description','price']].nlargest(columns ='price', n = 1)
top_stock

                      description     price
2310  PAPER CRAFT , LITTLE BIRDIE  168469.6

## ⭐️⭐️ Вопрос 15

Создайте новую таблицу purchases, в которой каждая строка будет соответствовать отдельной покупке, со столбцами 
InvoiceNo, InvoiceDate, Price, CustomerID, Country.

Поскольку дата InvoiceDate может быть отличаться для разных транзакций внутри одной покупки, при группировке возьмите самую раннюю из дат. Также отсортируйте её по датам по возрастанию.

Учтите, что InvoiceDate — не уникальное поле, данные стоит дополнительно отсортировать по InvoiceNo, перед тем как брать первое значение группы.

Сколько получилось строк?

#### Решение

In [ ]:
df_cl.head(1)

  invoiceno stockcode  ...         country  price
0    536365    85123A  ...  United Kingdom   15.3

[1 rows x 9 columns]

In [ ]:
 purchases = df_cl.sort_values(['invoiceno', 'invoicedate']).\
 groupby('invoiceno').agg({'invoicedate' : 'first', 'price' : 'sum', 'customerid' : 'first', 'country': 'first'}).\
 reset_index()[['invoiceno', 'invoicedate', 'price', 'customerid', 'country']]

In [ ]:
 purchases.head()

  invoiceno          invoicedate   price  customerid         country
0    536365  2010-12-01 08:26:00  139.12     17850.0  United Kingdom
1    536366  2010-12-01 08:28:00   22.20     17850.0  United Kingdom
2    536367  2010-12-01 08:34:00  278.73     13047.0  United Kingdom
3    536368  2010-12-01 08:34:00   70.05     13047.0  United Kingdom
4    536369  2010-12-01 08:35:00   17.85     13047.0  United Kingdom

In [ ]:
 purchases.shape[0]

18533

## ⭐️⭐️ Вопрос 16

Исследуем, растут или убывают покупки наших клиентов после их первой покупки на сайте. Найдите среднюю цену первых покупок клиентов: для каждого клиента возьмите его первую покупку и усредните эти значения. Найдите среднюю цену покупок в целом. Округлите эти числа до целых и перечислите в этом порядке через запятую.

\* При равных TimeStamp по покупкам первой считается покупка с меньшим InvoiceNo.

#### Решение

In [ ]:
firs_buy = purchases[['customerid', 'invoicedate', 'invoiceno']].groupby('customerid').agg('min')
df_firs_buy_mean = purchases[(purchases['invoicedate'].isin(firs_buy['invoicedate'])) & (purchases['invoiceno'].isin(firs_buy['invoiceno']))]['price'].mean()

In [ ]:
df_all_buy_mean = purchases['price'].mean()

In [ ]:
print(round(df_firs_buy_mean, 0))
print(round(df_all_buy_mean, 0))

426.0
481.0

## ⭐️⭐️⭐️ Вопрос 17

В какой день недели было наибольшее число покупок? В ответе укажите русское название дня недели, начинающееся с заглавной буквы.


Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите день недели, в который она была совершена. Сохраните в новый столбец.
* Сгруппируйте таблицу по дням недели.

#### Решение

In [ ]:
import datetime
import calendar

purchases['weekday'] = purchases['invoicedate'].iloc[:].apply(lambda x: calendar.day_name[datetime.datetime.strptime(x, '%Y-%m-%d %H:%M:%S').weekday()])
purchases.tail()

      invoiceno          invoicedate  ...         country  weekday
18528    581584  2011-12-09 12:25:00  ...  United Kingdom   Friday
18529    581585  2011-12-09 12:31:00  ...  United Kingdom   Friday
18530    581586  2011-12-09 12:49:00  ...  United Kingdom   Friday
18531    581587  2011-12-09 12:50:00  ...          France   Friday
18532    581588  2011-12-09 12:52:00  ...           Italy   Friday

[5 rows x 6 columns]

In [ ]:
def rus_dayweek(day):
  if day == 'Sonday':
    return 'Воскресенье'
  elif day == 'Monday':
    return 'Понедельник'
  elif day == 'Tuesday':
    return 'Вторник'
  elif day == 'Wednesday':
    return 'Среда'
  elif day == 'Thursday':
    return 'Четверг'
  elif day == 'Friday':
    return 'Пятница'
  elif day == 'Saturday':
    return 'Суббота'

In [ ]:
purchases['weekday'] = purchases['weekday'].iloc[:].apply(lambda x: rus_dayweek(x))
purchases.tail()

      invoiceno          invoicedate  ...         country  weekday
18528    581584  2011-12-09 12:25:00  ...  United Kingdom  Пятница
18529    581585  2011-12-09 12:31:00  ...  United Kingdom  Пятница
18530    581586  2011-12-09 12:49:00  ...  United Kingdom  Пятница
18531    581587  2011-12-09 12:50:00  ...          France  Пятница
18532    581588  2011-12-09 12:52:00  ...           Italy  Пятница

[5 rows x 6 columns]

In [ ]:
purchases.groupby('weekday').agg('count').reset_index().nlargest(columns = 'invoiceno', n = 3)

   weekday  invoiceno  invoicedate  price  customerid  country
4  Четверг       4032         4032   4032        4032     4032
3    Среда       3455         3455   3455        3455     3455
0  Вторник       3184         3184   3184        3184     3184

## ⭐️⭐️⭐️ Вопрос 18

В какой год и месяц выручка была максимальной?

Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите год и месяц, в которые она была совершена. Сохраните в новые столбцы.
* Сгруппируйте таблицу по новым столбцам

В ответе укажите два целых числа через запятую: год, месяц

#### Решение

In [ ]:
purchases['month'] = purchases['invoicedate'].iloc[:].apply(lambda x: datetime.datetime.strptime(x, '%Y-%m-%d %H:%M:%S').month)
purchases['year'] = purchases['invoicedate'].iloc[:].apply(lambda x: datetime.datetime.strptime(x, '%Y-%m-%d %H:%M:%S').year)
purchases.tail()

      invoiceno          invoicedate   price  ...  weekday month  year
18528    581584  2011-12-09 12:25:00  140.64  ...  Пятница    12  2011
18529    581585  2011-12-09 12:31:00  329.05  ...  Пятница    12  2011
18530    581586  2011-12-09 12:49:00  339.20  ...  Пятница    12  2011
18531    581587  2011-12-09 12:50:00  249.45  ...  Пятница    12  2011
18532    581588  2011-12-09 12:52:00   37.80  ...  Пятница    12  2011

[5 rows x 8 columns]

In [ ]:
purchases.groupby(['year', 'month']).agg('sum').reset_index()[['price', 'month', 'year']].nlargest(columns='price', n = 3)

          price  month  year
11  1161817.380     11  2011
10  1039318.790     10  2011
9    952838.382      9  2011

## ⭐️⭐️⭐️ Вопрос 19

Магазин продаёт товары покупателям из разных стран (Country). В какой стране был наибольший процентный рост месячных продаж, если сравнить март 2011 и сентябрь 2011? Сколько процентов составил этот рост? В расчёт брать только страны, в которых были ненулевые продажи в обоих этих месяцах. В ответе укажите через запятую название страны и целое число (процентный рост, округлённый до целого числа).

#### Решение

In [ ]:
m_y = lambda x: str(x['month']) + '-' + str(x['year'])
purchases['m - y'] = purchases.apply(m_y, axis=1)

In [ ]:
df_country = purchases[purchases['m - y'].isin(['3-2011', '9-2011'])].groupby(['country', 'm - y']).agg('sum')['price'].unstack('m - y').dropna()
df_country = df_country[df_country['9-2011'] > df_country['3-2011']]
df_country['percent'] = round(df_country['3-2011'] / df_country['9-2011'] * 100, 0)

In [ ]:
df_country.nlargest(columns='percent', n = 3)

m - y          3-2011    9-2011  percent
country
Denmark       3978.99   4570.16     87.0
Netherlands  22416.49  26937.26     83.0
Belgium       3351.98   4208.02     80.0

## ⭐️⭐️⭐️ Вопрос 20

Большинство клиентов все свои покупки делают из одной и той же страны. Выясним, однако, насколько велика доля путешественников среди клиентов. 
Сколько клиентов сделали покупки по крайней мере из двух разных стран? (ответ - целое число)

#### Решение

In [ ]:
count_traveler = purchases[['customerid', 'country']].groupby('customerid').agg('nunique')
count_traveler[count_traveler['country'] > 1].count()

country    8
dtype: int64

## ⭐️⭐️⭐️ Вопрос 21

Мы запускаем в Италии рекомендательную систему "С этим товаром часто покупают...", и для этого хотим узнать, какие различные товары чаще всего встречаются в одной покупке из этой страны. Определите, какая пара различных товаров чаще всего встречается в различных покупках с ```Country=='Italy'```, и в скольких покупках это происходит. Одинаковые товары или нет, проверяйте по равенству поля Description. 

(ответ: название (Description) первого товара, название (Description) второго товара, целое число)

#### Решение

In [ ]:
#сортируем массив по стране
df_italy = df_cl[df_cl['country'] == 'Italy']
#создаю список для списков комбинаций
list_of_comb = []
#цикл который пробегает по каждому УНИКАЛЬНОМУ инвойсу, затем создает комбинации
#всех возможных комбинаций без повторений
for invoce in df_italy['invoiceno'].unique():
  for i, tovar in enumerate(df_italy[df_italy['invoiceno'] == invoce]['description']):
    for j, tovar_2 in enumerate(df_italy[df_italy['invoiceno'] == invoce]['description']):
      comb = []
      #условие исключающее повторения товаров в одном инвойсе
      if j > i:
        comb.append(tovar)
        comb.append(tovar_2)
        #сортируем по алфавиту
        comb.sort()
        list_of_comb.append(comb)

In [ ]:
df_comb = pd.DataFrame(list_of_comb, columns=['first', 'second'])
df_comb['count'] = 0
df_comb.head()

                                 first                        second  count
0         SCENTED VELVET LOUNGE CANDLE  T-LIGHT GLASS FLUTED ANTIQUE      0
1        BLUE FLOCK GLASS CANDLEHOLDER  T-LIGHT GLASS FLUTED ANTIQUE      0
2  SILVER GLITTER FLOWER VOTIVE HOLDER  T-LIGHT GLASS FLUTED ANTIQUE      0
3      6 CHOCOLATE LOVE HEART T-LIGHTS  T-LIGHT GLASS FLUTED ANTIQUE      0
4              SET OF 6 T-LIGHTS SANTA  T-LIGHT GLASS FLUTED ANTIQUE      0

In [ ]:
df_comb_b = df_comb.groupby(['first', 'second']).agg('count').reset_index()
df_comb_b.nlargest(columns='count', n = 5)

                               first                            second  count
13160         TOY TIDY PINK POLKADOT                 TOY TIDY SPACEBOY      6
11035  PLASTERS IN TIN CIRCUS PARADE  PLASTERS IN TIN WOODLAND ANIMALS      5
2001     BREAD BIN DINER STYLE IVORY                DOORMAT UNION FLAG      4
2014     BREAD BIN DINER STYLE IVORY          JAM MAKING SET WITH JARS      4
2044     BREAD BIN DINER STYLE IVORY  SET OF 3 CAKE TINS PANTRY DESIGN      4